Repository: Tobiaskr12/OmmelSamvirke2024
Catalog: Src/DomainModules/Errors/ErrorMessages.*.resx
Languages: da

# Attachment_BinaryContent_IsEmpty
source: The email attachment has no content, making it invalid
da: Den vedhæftede fil har ikke noget indhold. Filen er derfor ikke gyldig

# ContactList_Description_InvalidLength
source: The description of a contact list must be between 5-2000 characters long
da: Beskrivelsen af en kontaktliste skal være mellem 5-2000 tegn lang

# ContactList_Name_InvalidLength
source: The name of a contact list must be between 3-200 characters long
da: Navnet på en kontaktliste skal være mellem 3-200 tegn langt

# Email_SenderAddress_MustBeApproved
source: The sender address is not approved for sending emails
da: Afsendingsadressen er ikke godkendt til af sende emails

# Email_SenderAddress_MustNotBeEmpty
source: The sender address must not be empty
da: Afsendingsadressen må ikke være tom

# Email_Subject_InvalidLength
source: The subject must be between 3-80 characters long
da: Emnefeltet skal være mellem 3-80 tegn langt

# Email_Body_InvalidLength
source: The body content must be at least 20 characters long and the content size must be less than 7MB
da: Indholdet skal være mindst 20 tegn langt og det må ikke fylde mere end 7MB

# Email_Recipient_InvalidSize
source: The email must have between 1-50 recipients
da: Emailen skal have mellem 1-50 modtagere

# Email_Attachments_InvalidSize
source: The email can not have more than 10 attachments
da: Emailen kan ikke have mere end 10 vedhæftede filer

# Email_ContentSize_TooLarge
source: The total size of the email must be less than 7.5MB
da: Emailen må ikke overstige en størrelse på 7.5MB

# Attachment_Name_InvalidLength
source: The email attachment name must be between 5-256 characters long
da: Den vedhæftede fils navn skal være mellem 5-256 tegn langt

# Attachment_BinaryContent_TooLarge
source: The email attachment can not be larger than 7.5MB
da: En vedhæftet fil må ikke være større end 7.5MB

# Recipient_EmailAddress_MustBeValid
source: At least one recipient email address is invalid
da: Der er mindst én modtager-emailadresse som ikke er gyldig

# Email_Recipients_MustBeUnique
source: The email recipients must be unique
da: Emailens modtagere skal være unikke

# Email_Attachments_MustBeUnique
source: The email attachments must be unique
da: Emailens vedhæftede filer skal være unikke

# NewsletterGroup_Name_InvalidLength
source: The name of the newsletter group must be between 3-150 characters long
da: Navnet på nyhedsbrevsgruppen skal være mellem 3-150 tegn langt

# NewsletterGroup_Description_InvalidLength
source: The description of the newsletter group must be between 5-500 characters long
da: Beskrivelsen på nyhedsbrevsgruppen skal være mellem 5-500 tegn lang

# NewsletterGroupsCleanupCampaign_CampaignDurationMonths_InvalidDuration
source: The email cleanup campaign must be at least 2 months long
da: Oprydningskampagnen skal være mindst 2 måneder lang

# NewsletterGroupsCleanupCampaign_CampaignStart_MustNotBeInThePast
source: The email cleanup campagin cannot have a start time in the past
da: Oprydningskampagnen kan ikke have et starttidspunkt der ligger i fortiden

# NewsletterSubscriptionAction_ConfirmationTime_NotAfterExpiry
source: The action could not be created because it has expired
da: Handlingen kunne ikke oprettes fordi den er udløbet

# NewsletterSubscriptionAction_Confirmation_AtMost7DaysInFuture
source: The action could not be created because the expiry is set to more than 7 days
da: Handlingen kunne ikke oprettes fordi den ikke kan sættes til at udløbe om mere end 7 dage

# NewsletterSubscriptionAction_Confirmation_NotNull
source: The action could not be created because no expiry is defined
da: Handlingen kunne ikke oprettes fordi en udløbsdato ikke er defineret

# NewsletterSubscriptionAction_IsConfirmed_NotNull
source: The action could not be created because the initial value is undefined
da: Handlingen kunne ikke oprettes fordi værdien er udefineret

# NewsletterSubscriptionAction_Token_NotEmpty
source: The action could not be created because the token is empty
da: Handlingen kunne ikke oprettes fordi nøglen for handlingen er tom

# BlockedReservationTimeSlot_EndTime_MustBeAfterStart
source: The end time must be at least an hour after the start time
da: Sluttidspunktet skal være mindst en time efter starttidspunktet

# Reservation_EndTime_MustBeAfterStart
source: The end time must be at least an hour after the start time
da: Sluttidspunktet skal være mindst en time efter starttidspunktet

# ReservationHistory_Email_InvalidStructure
source: The email is not valid
da: E-mailen er ikke gyldig

# ReservationHistory_Token_Empty
source: Reservation history token cannot be empty
da: Nøglen til reservationshistorikken kan ikke være tom

# Reservation_CommunityName_InvalidLength
source: The name of the community must be between 3-75 characters long
da: Navnet på foreningen skal være mellem 3-75 tegn langt

# Reservation_Email_InvalidStructure
source: The email is not valid
da: E-mailen er ikke gyldig

# Reservation_StartTIme_InPast
source: The start time must not be in the past
da: Starttidspunktet kan ikke være i fortiden

# Reservation_PhoneNumber_InvalidLength
source: Phone number must be between 5-20 characters long
da: Telefonnummer skal være mellem 5-20 tegn langt

# Reservation_Name_Empty
source: Name can not be empty
da: Navn må ikke være tomt

# Reservation_Name_InvalidLength
source: Name must be between 3-100 characters long
da: Navn skal være mellem 3-100 tegn langt

# Reservation_PhoneNumber_Empty
source: Phone number can not be empty
da: Telefonnummer må ikke være tomt

# BlockedReservationTimeSlot_StartTime_InPast
source: The start time must not be in the past
da: Starttidspunktet kan ikke være i fortiden

# ReservationLocation_Name_InvalidLength
source: The name of the reservation location must be between 3-75 characters long
da: Navnet på reservationslokationen skal være mellem 3-75 tegn langt

# ReservationSeries_InvalidInterval
source: The recurrence interval must be greater than zero
da: Gentagelsesintervallet skal være større end nul

# ReservationSeries_InvalidRecurrenceType
source: The recurrence type must be specified
da: Gentagelsesintervallet skal vælges

# ReservationSeries_StartDateInPast
source: The recurrence start date cannot be in the past
da: Startdatoen for gentagelsen må ikke være i fortiden

# ReservationSeries_InvalidRecurrenceDates
source: The recurrence end date must be after the start date
da: Slutdatoen for gentagelsen skal være efter startdatoen

# EventCoordinator_Name_NotEmpty
source: Event coordinator name must not be empty
da: Tovholderens navn må ikke være tomt

# EventCoordinator_Name_InvalidLength
source: Event coordinator name must be between 2 and 100 characters
da: Tovholderens navn skal være mellem 2 og 100 tegn

# EventCoordinator_EmailAddress_Invalid
source: Event coordinator email address is invalid
da: Tovholderens emailadresse er ugyldig

# EventCoordinator_PhoneNumber_Invalid
source: Event coordinator phone number is invalid
da: Tovholderens telefonnummer er ugyldigt

# Event_Title_NotEmpty
source: Event title must not be empty
da: Begivenhedens navn må ikke være tom

# Event_Title_InvalidLength
source: Event title must be between 3 and 100 characters
da: Begivenhedens navn skal være mellem 3 og 100 tegn

# Event_Description_NotEmpty
source: Event description must not be empty
da: Begivenhedsbeskrivelsen må ikke være tom

# Event_Description_InvalidLength
source: Event description must be between 10 and 5000 characters
da: Begivenhedsbeskrivelsen skal være mellem 10 og 5000 tegn

# Event_StartTime_MustBeInFuture
source: Event start time must be in the future
da: Begivenhedens starttid skal være i fremtiden

# Event_EndTime_MustBeAfterStart
source: Event end time must be after start time
da: Begivenhedens sluttid skal være efter starttid

# Event_Duration_Minimum15Minutes
source: Event duration must be at least 15 minutes
da: Begivenhedens varighed skal være mindst 15 minutter

# Event_EventCoordinator_NotNull
source: Event coordinator is required
da: En eventkoordinator er påkrævet

# Event_Location_NotEmpty
source: Event location must not be empty
da: Begivenhedens lokation må ikke være tom

# Event_Location_InvalidLength
source: Event location must be between 3 and 50 characters
da: Begivenhedens lokation skal være mellem 3 og 50 tegn

# Event_RemoteFiles_MustBeUnique
source: Remote files must be unique
da: Vedhæftede filer skal være unikke

# Event_RemoteFile_InvalidUrl
source: Each remote file must be a valid URL
da: Hver vedhæftet fil skal have en gyldig URL

# EventRemoteFile_FileName_NotEmpty
source: File name must not be empty
da: Filnavn må ikke være tomt

# EventRemoteFile_FileSize_Invalid
source: File size must be greater than 0 bytes
da: Filstørrelse skal være større end 0 byte

# EventRemoteFile_FileName_InvalidLength
source: File name must be between 1 and 255 characters
da: Filnavn skal være mellem 1 og 255 tegn

# EventRemoteFile_FileType_NotEmpty
source: File type must not be empty
da: Filtype må ikke være tom

# EventRemoteFile_FileType_InvalidLength
source: File type must be between 1 and 100 characters
da: Filtype skal være mellem 1 og 100 tegn

# EventRemoteFile_Url_NotEmpty
source: File URL must not be empty
da: Fil URL må ikke være tom

# EventRemoteFile_Url_Invalid
source: File URL must be a valid URL
da: Fil URL skal være en gyldig URL

# Event_RemoteFiles_NotNull
source: Remote files collection must not be null
da: Vedhæftede filer må ikke være null

# BlobStorageFile_FileBaseName_NotEmpty
source: The file name must not be empty
da: Filens navn må ikke være tomt

# BlobStorageFile_FileExtension_NotEmpty
source: File extension must not be empty
da: Filtypen må ikke være tom

# BlobStorageFile_FileExtension_Invalid
source: File extension contains invalid characters. Only alphanumeric characters are allowed
da: Filtypen indeholder ugyldige tegn. Kun alfanumeriske tegn er tilladt

# BlobStorageFile_FileSize_GreaterThanZero
source: File size must be greater than zero
da: Filstørrelsen skal være større end nul

# BlobStorageFile_ContentType_NotEmpty
source: Content type must not be empty
da: Indholdstypen må ikke være tom

# BlobStorageFile_BlobGuid_NotEmpty
source: Blob GUID must not be empty
da: Blob GUID må ikke være tom

# Album_Name_NotEmpty
source: Album name must not be empty
da: Albumnavn må ikke være tom

# Album_Name_InvalidLength
source: Album name must be between 3 and 100 characters
da: Albumnavn skal være mellem 3 og 100 tegn

# Album_Description_InvalidLength
source: Description must be at most 500 characters long
da: Beskrivelsen må højst være 500 tegn lang

# Album_Images_InvalidSize
source: At least one image is required
da: Der skal være mindst ét billede i albummet

# Album_CoverImage_MustBeInImages
source: Cover image must be one of the album's images
da: Forsidebilledet skal være et af albummets billeder

# Image_OriginalUpload_NotEmpty
source: Please upload an image file
da: Upload venligst en billedfil

# Image_DateTaken_InFuture
source: Photo date cannot be in the future
da: Billedets dato kan ikke ligge i fremtiden

# Image_Location_InvalidLength
source: Location must be at most 256 characters
da: Billedets lokation må højst være 256 tegn

# Image_PhotographerName_InvalidLength
source: Photographer name must be at most 100 characters
da: Fotografens navn må højst være 100 tegn

# Image_Title_InvalidLength
source: Title must be at most 100 characters
da: Titlen må højst være 100 tegn

# Image_Description_InvalidLength
source: Description must be at most 500 characters
da: Beskrivelsen må højst være 500 tegn

# GenericError
source: An error occurred
da: Der opstod en fejl
